app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
---
  def index
    @courses = Course.all

SELECT "courses".* FROM "courses" WHERE (lower(department_id) LIKE '%1010%' OR lower(number) LIKE '%1010%' OR lower(hours) LIKE '%1010%')
---
  def search
    if params[:search].blank?
      redirect_to courses_path and return
    else
      @parameter = params[:search].downcase
      @matchDept = Course.where("lower(department_id) LIKE :search OR lower(number) LIKE :search OR lower(hours) LIKE :search", search: "%#{@parameter}%")

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_course
      @course = Course.find(params[:id])