app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections"
---
  def index
    @sections = Section.all

SELECT "students".* FROM "students"
---
  def new
    @section = Section.new
    @students = Student.all

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_section
      @section = Section.find(params[:id])