app/controllers/semesters_controller.rb

SELECT "semesters".* FROM "semesters"
---
  def index
    @semesters = Semester.all

SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_semester
      @semester = Semester.find(params[:id])