app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
  def index
    @students = Student.all

SELECT "sections".* FROM "sections"
---
  def new
    @student = Student.new
    @sections = Section.all

SELECT "sections".* FROM "sections" WHERE 1=0
---
  def edit
    @sections = Section.all

INSERT INTO "students" ("name", "identifier", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Jeremy"], ["identifier", 2], ["created_at", "2020-09-27 19:51:46.214221"], ["updated_at", "2020-09-27 19:51:46.214221"]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_student
      @student = Student.find(params[:id])